// 自动生成的代码。请勿编辑。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":
            case "myImage":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

    helpers._registerFactory("song", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "song1":
            case "mySong":return hex`00780004080200`;
            case "song3":
            case "BGM":return hex`0078000408040205001c000f0a006400f4010a0000040000000000000000000000000000000002600000000800012708001000011d10001800011e18002000011b20002800012528003000011b30003800011d38004000011940004800012748005000011d50005800011e58006000011b60006800012568007000011b70007800011d78008000011906001c00010a006400f401640000040000000000000000000000000000000002540000000200011804000600011810001200010a20002200011624002600011630003200010832003400010840004200011844004600011850005200010a600062000116640066000116700072000108720074000108`;
        }
        return null;
    })

}
// 自动生成的代码。请勿编辑。
